GrumpyOldPizza/ArduinoCore-stm32wb/system/STM32WBxx/Source/stm32wb_usbd_cdc.c
/*
 * Copyright (c) 2016-2021 Thomas Roell.  All rights reserved.
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy
 * of this software and associated documentation files (the "Software"), to
 * deal with the Software without restriction, including without limitation the
 * rights to use, copy, modify, merge, publish, distribute, sublicense, and/or
 * sell copies of the Software, and to permit persons to whom the Software is
 * furnished to do so, subject to the following conditions:
 *
 *  1. Redistributions of source code must retain the above copyright notice,
 *     this list of conditions and the following disclaimers.
 *  2. Redistributions in binary form must reproduce the above copyright
 *     notice, this list of conditions and the following disclaimers in the
 *     documentation and/or other materials provided with the distribution.
 *  3. Neither the name of Thomas Roell, nor the names of its contributors
 *     may be used to endorse or promote products derived from this Software
 *     without specific prior written permission.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT.  IN NO EVENT SHALL THE
 * CONTRIBUTORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
 * LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING
 * FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS
 * WITH THE SOFTWARE.
 */

#include "armv7m.h"
#include "stm32wb_system.h"
#include "stm32wb_usbd.h"
#include "stm32wb_usbd_cdc.h"
#include "stm32wb_usbd_dcd.h"

#define STM32WB_USBD_CDC_STATE_NONE       0
#define STM32WB_USBD_CDC_STATE_INIT       1
#define STM32WB_USBD_CDC_STATE_NOT_READY  2
#define STM32WB_USBD_CDC_STATE_READY      3
#define STM32WB_USBD_CDC_STATE_CONNECTED  4

#define STM32WB_USBD_CDC_INT_IDLE         0
#define STM32WB_USBD_CDC_INT_BUSY         1

#define STM32WB_USBD_CDC_TX_IDLE          0
#define STM32WB_USBD_CDC_TX_BUSY          1
#define STM32WB_USBD_CDC_TX_ZLP           2

typedef struct _stm32wb_usbd_cdc_control_t {
    volatile uint8_t                        state;
    volatile uint8_t                        started;
    volatile uint8_t                        suspended;
    uint8_t                                 interface;    
    struct {
        stm32wb_usbd_request_t                  request;
        uint8_t                                 data[2];
    }                                       notification;
    volatile uint16_t                       serial_state;
    volatile uint16_t                       break_state;
    volatile uint16_t                       line_state;
    volatile stm32wb_usbd_cdc_line_coding_t line_coding;
    stm32wb_usbd_cdc_event_callback_t       ev_callback;
    void                                    *ev_context;
    volatile uint8_t                        int_busy;
    volatile uint8_t                        int_request;
    volatile uint8_t                        tx_busy;
    volatile uint8_t                        tx_zlp;
    const uint8_t * volatile                tx_data;
    uint32_t                                tx_count;
    stm32wb_usbd_cdc_done_callback_t        tx_callback;
    void                                    *tx_context;
    uint8_t                                 *rx_data;
    uint32_t                                rx_size;
    volatile uint16_t                       rx_write;
    volatile uint16_t                       rx_read;
    volatile uint16_t                       rx_count;
    volatile uint8_t                        rx_event;
    uint8_t                                 rx_index;
    uint8_t                                 rx_fifo[2][STM32WB_USBD_CDC_DATA_MAX_PACKET_SIZE];
} stm32wb_usbd_cdc_control_t;

static stm32wb_usbd_cdc_control_t stm32wb_usbd_cdc_control;

typedef struct _stm32wb_usbd_cdc_transmit_params_t {
    const uint8_t                           *tx_data;
    uint32_t                                tx_count;
    stm32wb_usbd_cdc_done_callback_t        callback;
    void                                    *context;
} stm32wb_usbd_cdc_transmit_params_t;

static void stm32wb_usbd_cdc_rx_callback(void *context, uint8_t ep_addr, uint32_t length)
{
    uint32_t rx_count, rx_size, rx_write, events;

    stm32wb_usbd_dcd_ep_receive(STM32WB_USBD_CDC_DATA_OUT_EP_ADDR, &stm32wb_usbd_cdc_control.rx_fifo[stm32wb_usbd_cdc_control.rx_index ^ 1][0], STM32WB_USBD_CDC_DATA_MAX_PACKET_SIZE, stm32wb_usbd_cdc_rx_callback, NULL);

    if (stm32wb_usbd_cdc_control.state >= STM32WB_USBD_CDC_STATE_READY)
    {
	events = 0;

        while (length)
        {
	    rx_count = length;
	    rx_size = stm32wb_usbd_cdc_control.rx_size - stm32wb_usbd_cdc_control.rx_count;
	    rx_write = stm32wb_usbd_cdc_control.rx_write;

            if (rx_count > rx_size)
            {
                rx_count = rx_size;
            }

	    if (!rx_count)
	    {
		break;
	    }
	    
            rx_size = rx_count;
            
            if (rx_size > (stm32wb_usbd_cdc_control.rx_size - rx_write))
            {
                rx_size = stm32wb_usbd_cdc_control.rx_size - rx_write;
            }
            
            if (rx_size)
            {
                memcpy(&stm32wb_usbd_cdc_control.rx_data[rx_write], &stm32wb_usbd_cdc_control.rx_fifo[stm32wb_usbd_cdc_control.rx_index][0], rx_size);
                
                rx_count -= rx_size;
                rx_write += rx_size;
                
                if (rx_write == stm32wb_usbd_cdc_control.rx_size)
                {
                    rx_write = 0;
                }
            }
            
            if (rx_count)
            {
                memcpy(&stm32wb_usbd_cdc_control.rx_data[rx_write], &stm32wb_usbd_cdc_control.rx_fifo[stm32wb_usbd_cdc_control.rx_index][rx_size], rx_count);
                
                rx_write += rx_count;
                
                if (rx_write == stm32wb_usbd_cdc_control.rx_size)
                {
                    rx_write = 0;
                }
            }

	    armv7m_atomic_addh(&stm32wb_usbd_cdc_control.rx_count, (rx_size + rx_count));

	    stm32wb_usbd_cdc_control.rx_write = rx_write;
	    
	    length -= (rx_size + rx_count);

            if (stm32wb_usbd_cdc_control.rx_event)
            {
                stm32wb_usbd_cdc_control.rx_event = false;
                
