GrumpyOldPizza/ArduinoCore-stm32wb/system/STM32WBxx/Source/stm32wb_usbd_cdc.c
                events = STM32WB_USBD_CDC_EVENT_RECEIVE;
            }
	}

	if (length)
	{
	    events |= STM32WB_USBD_CDC_EVENT_OVERRUN;
	}
	
	if (events)
	{
	    if (stm32wb_usbd_cdc_control.ev_callback)
	    {
		(*stm32wb_usbd_cdc_control.ev_callback)(stm32wb_usbd_cdc_control.ev_context, events);
	    }
        }
    }

    stm32wb_usbd_cdc_control.rx_index ^= 1;
}

static void stm32wb_usbd_cdc_tx_callback(void *context, uint8_t ep_addr)
{      
    stm32wb_usbd_cdc_done_callback_t callback;

    if (stm32wb_usbd_cdc_control.tx_busy == STM32WB_USBD_CDC_TX_ZLP)
    {
	if (stm32wb_usbd_cdc_control.tx_data)
	{
	    stm32wb_usbd_cdc_control.tx_busy = STM32WB_USBD_CDC_TX_BUSY;

	    stm32wb_usbd_cdc_control.tx_zlp = stm32wb_usbd_cdc_control.tx_count && !(stm32wb_usbd_cdc_control.tx_count & (STM32WB_USBD_CDC_DATA_MAX_PACKET_SIZE -1));
            
            stm32wb_usbd_dcd_ep_transmit(STM32WB_USBD_CDC_DATA_IN_EP_ADDR, (uint8_t*)stm32wb_usbd_cdc_control.tx_data, stm32wb_usbd_cdc_control.tx_count, stm32wb_usbd_cdc_tx_callback, NULL);
	}
	else
	{
	    stm32wb_usbd_cdc_control.tx_busy = STM32WB_USBD_CDC_TX_IDLE;

#if (STM32WB_USBD_DCD_LPM_SUPPORTED == 1)
            stm32wb_usbd_dcd_lpm_unreference(STM32WB_USBD_DCD_EP_MASK(STM32WB_USBD_CDC_DATA_IN_EP_ADDR));
#endif /* STM32WB_USBD_DCD_LPM_SUPPORTED == 1 */
	}
    }
    else
    {
	callback = stm32wb_usbd_cdc_control.tx_callback;
	context = stm32wb_usbd_cdc_control.tx_context;

	stm32wb_usbd_cdc_control.tx_data = NULL;
	    
	if (callback)
	{
	    (*callback)(context);
	}
	
	if (stm32wb_usbd_cdc_control.tx_data)
	{
	    stm32wb_usbd_cdc_control.tx_zlp = stm32wb_usbd_cdc_control.tx_count && !(stm32wb_usbd_cdc_control.tx_count & (STM32WB_USBD_CDC_DATA_MAX_PACKET_SIZE -1));

            stm32wb_usbd_dcd_ep_transmit(STM32WB_USBD_CDC_DATA_IN_EP_ADDR, (uint8_t*)stm32wb_usbd_cdc_control.tx_data, stm32wb_usbd_cdc_control.tx_count, stm32wb_usbd_cdc_tx_callback, NULL);
	}
	else
	{
	    if (stm32wb_usbd_cdc_control.tx_zlp)
	    {
		stm32wb_usbd_cdc_control.tx_busy = STM32WB_USBD_CDC_TX_ZLP;

		stm32wb_usbd_cdc_control.tx_zlp = false;
		
                stm32wb_usbd_dcd_ep_transmit(STM32WB_USBD_CDC_DATA_IN_EP_ADDR, NULL, 0, stm32wb_usbd_cdc_tx_callback, NULL);
	    }
	    else
	    {
		stm32wb_usbd_cdc_control.tx_busy = STM32WB_USBD_CDC_TX_IDLE;

#if (STM32WB_USBD_DCD_LPM_SUPPORTED == 1)
                stm32wb_usbd_dcd_lpm_unreference(STM32WB_USBD_DCD_EP_MASK(STM32WB_USBD_CDC_DATA_IN_EP_ADDR));
#endif /* STM32WB_USBD_DCD_LPM_SUPPORTED == 1 */
	    }
	}
    }
}

static void stm32wb_usbd_cdc_tx_flush(void)
{
    stm32wb_usbd_cdc_done_callback_t callback;
    void *context;

    if (armv7m_atomic_swapb(&stm32wb_usbd_cdc_control.tx_busy, STM32WB_USBD_CDC_TX_IDLE) != STM32WB_USBD_CDC_TX_IDLE)
    {
        stm32wb_usbd_dcd_ep_flush(STM32WB_USBD_CDC_DATA_IN_EP_ADDR);

#if (STM32WB_USBD_DCD_LPM_SUPPORTED == 1)
        stm32wb_usbd_dcd_lpm_unreference(STM32WB_USBD_DCD_EP_MASK(STM32WB_USBD_CDC_DATA_IN_EP_ADDR));
#endif /* STM32WB_USBD_DCD_LPM_SUPPORTED == 1 */
    }
    
    stm32wb_usbd_cdc_control.tx_zlp = false;

    if (stm32wb_usbd_cdc_control.tx_data)
    {
	callback = stm32wb_usbd_cdc_control.tx_callback;
	context = stm32wb_usbd_cdc_control.tx_context;
	
	stm32wb_usbd_cdc_control.tx_data = NULL;
	
	if (callback)
	{
	    (*callback)(context);
	}
    }
}    

static void stm32wb_usbd_cdc_int_callback(void *context, uint8_t ep_addr)
{
    uint8_t int_request;
    uint16_t serial_state;

    serial_state = armv7m_atomic_andh(&stm32wb_usbd_cdc_control.serial_state, ~(USB_CDC_SERIAL_STATE_DCD | USB_CDC_SERIAL_STATE_DSR | USB_CDC_SERIAL_STATE_BREAK | USB_CDC_SERIAL_STATE_RI));

    if ((serial_state & USB_CDC_SERIAL_STATE_DSR) && (stm32wb_usbd_cdc_control.state == STM32WB_USBD_CDC_STATE_READY))
    {
        stm32wb_usbd_cdc_control.state = STM32WB_USBD_CDC_STATE_CONNECTED;

        if (stm32wb_usbd_cdc_control.tx_data)
        {
            if (armv7m_atomic_casb(&stm32wb_usbd_cdc_control.tx_busy, STM32WB_USBD_CDC_TX_IDLE, STM32WB_USBD_CDC_TX_BUSY) == STM32WB_USBD_CDC_TX_IDLE)
            {
#if (STM32WB_USBD_DCD_LPM_SUPPORTED == 1)
                stm32wb_usbd_dcd_lpm_reference(STM32WB_USBD_DCD_EP_MASK(STM32WB_USBD_CDC_DATA_IN_EP_ADDR));
#endif /* STM32WB_USBD_DCD_LPM_SUPPORTED == 1 */

                stm32wb_usbd_cdc_control.tx_zlp = stm32wb_usbd_cdc_control.tx_count && !(stm32wb_usbd_cdc_control.tx_count & (STM32WB_USBD_CDC_DATA_MAX_PACKET_SIZE -1));
                
                stm32wb_usbd_dcd_ep_transmit(STM32WB_USBD_CDC_DATA_IN_EP_ADDR, (uint8_t*)stm32wb_usbd_cdc_control.tx_data, stm32wb_usbd_cdc_control.tx_count, stm32wb_usbd_cdc_tx_callback, NULL);
            }
        }
    }

    int_request = armv7m_atomic_swapb(&stm32wb_usbd_cdc_control.int_request, false);

    if (int_request)
    {
        serial_state = stm32wb_usbd_cdc_control.serial_state;
            
        stm32wb_usbd_cdc_control.notification.data[0] = serial_state & 255;
        stm32wb_usbd_cdc_control.notification.data[1] = serial_state >> 8;
        
        stm32wb_usbd_dcd_ep_transmit(STM32WB_USBD_CDC_CONTROL_EP_ADDR, (uint8_t*)&stm32wb_usbd_cdc_control.notification, 10, stm32wb_usbd_cdc_int_callback, NULL);
    }
    else
    {
        stm32wb_usbd_cdc_control.int_busy = STM32WB_USBD_CDC_INT_IDLE;
    }
}

static void stm32wb_usbd_cdc_int_request(void)
{
    uint16_t serial_state;

    stm32wb_usbd_cdc_control.int_request = true;

    if (!stm32wb_usbd_cdc_control.started)
    {
        return;
    }

    if (stm32wb_usbd_cdc_control.suspended)
    {
        stm32wb_usbd_wakeup();

        return;
    }
    
    if (armv7m_atomic_casb(&stm32wb_usbd_cdc_control.int_busy, STM32WB_USBD_CDC_INT_IDLE, STM32WB_USBD_CDC_INT_BUSY) != STM32WB_USBD_CDC_INT_IDLE)
    {
        return;
    }
    
    stm32wb_usbd_cdc_control.int_request = false;
            
    serial_state = stm32wb_usbd_cdc_control.serial_state;
            
    stm32wb_usbd_cdc_control.notification.data[0] = serial_state & 255;
    stm32wb_usbd_cdc_control.notification.data[1] = serial_state >> 8;
        
    stm32wb_usbd_dcd_ep_transmit(STM32WB_USBD_CDC_CONTROL_EP_ADDR, (uint8_t*)&stm32wb_usbd_cdc_control.notification, 10, stm32wb_usbd_cdc_int_callback, NULL);
}

static void stm32wb_usbd_cdc_int_flush(void)
{
    if (armv7m_atomic_swapb(&stm32wb_usbd_cdc_control.int_busy, STM32WB_USBD_CDC_INT_IDLE) != STM32WB_USBD_CDC_INT_IDLE)
    {
        stm32wb_usbd_dcd_ep_flush(STM32WB_USBD_CDC_CONTROL_EP_ADDR);

#if (STM32WB_USBD_DCD_LPM_SUPPORTED == 1)
        stm32wb_usbd_dcd_lpm_unreference(STM32WB_USBD_DCD_EP_MASK(STM32WB_USBD_CDC_CONTROL_EP_ADDR));
#endif /* STM32WB_USBD_DCD_LPM_SUPPORTED == 1 */
    }
}

static void stm32wb_usbd_cdc_configure(void *context, uint8_t interface)
{
    stm32wb_usbd_cdc_control.started = false;
    stm32wb_usbd_cdc_control.suspended = false;
    stm32wb_usbd_cdc_control.interface = interface;

    stm32wb_usbd_cdc_control.notification.request.bmRequestType = USB_REQ_DIRECTION_DEVICE_TO_HOST | USB_REQ_TYPE_CLASS | USB_REQ_RECIPIENT_INTERFACE;
    stm32wb_usbd_cdc_control.notification.request.bRequest = USB_REQ_CDC_SERIAL_STATE;
    stm32wb_usbd_cdc_control.notification.request.wValue = 0;
    stm32wb_usbd_cdc_control.notification.request.wIndex = stm32wb_usbd_cdc_control.interface;
    stm32wb_usbd_cdc_control.notification.request.wLength = 2;

    stm32wb_usbd_cdc_control.serial_state = 0;
    stm32wb_usbd_cdc_control.break_state = 0;
    stm32wb_usbd_cdc_control.line_state = 0;
    stm32wb_usbd_cdc_control.line_coding.dwDTERate = STM32WB_USBD_CDC_LINE_CODING_DTE_RATE;
    stm32wb_usbd_cdc_control.line_coding.bCharFormat = STM32WB_USBD_CDC_LINE_CODING_CHAR_FORMAT;
    stm32wb_usbd_cdc_control.line_coding.bParityType = STM32WB_USBD_CDC_LINE_CODING_PARITY_TYPE;
    stm32wb_usbd_cdc_control.line_coding.bDataBits = STM32WB_USBD_CDC_LINE_CODING_DATA_BITS;
    
    stm32wb_usbd_cdc_control.tx_busy = STM32WB_USBD_CDC_TX_IDLE;

    stm32wb_usbd_dcd_ep_configure(STM32WB_USBD_CDC_CONTROL_EP_ADDR, STM32WB_USBD_DCD_EP_TYPE_INTERRUPT, STM32WB_USBD_CDC_CONTROL_MAX_PACKET_SIZE);
    stm32wb_usbd_dcd_ep_configure(STM32WB_USBD_CDC_DATA_IN_EP_ADDR, STM32WB_USBD_DCD_EP_TYPE_BULK, STM32WB_USBD_CDC_DATA_MAX_PACKET_SIZE);
    stm32wb_usbd_dcd_ep_configure(STM32WB_USBD_CDC_DATA_OUT_EP_ADDR, STM32WB_USBD_DCD_EP_TYPE_BULK, STM32WB_USBD_CDC_DATA_MAX_PACKET_SIZE);

    stm32wb_usbd_cdc_control.state = STM32WB_USBD_CDC_STATE_INIT;
}

static void stm32wb_usbd_cdc_start(void *context)
{
    stm32wb_usbd_dcd_ep_enable(STM32WB_USBD_CDC_CONTROL_EP_ADDR);
    stm32wb_usbd_dcd_ep_enable(STM32WB_USBD_CDC_DATA_IN_EP_ADDR);
    stm32wb_usbd_dcd_ep_enable(STM32WB_USBD_CDC_DATA_OUT_EP_ADDR);

    stm32wb_usbd_cdc_control.started = true;
    stm32wb_usbd_cdc_control.suspended = false;

