GrumpyOldPizza/ArduinoCore-stm32wb/system/STM32WBxx/Source/stm32wb_usbd_cdc.c
    stm32wb_usbd_cdc_int_request();
    
    stm32wb_usbd_dcd_ep_receive(STM32WB_USBD_CDC_DATA_OUT_EP_ADDR, &stm32wb_usbd_cdc_control.rx_fifo[0][0], STM32WB_USBD_CDC_DATA_MAX_PACKET_SIZE, stm32wb_usbd_cdc_rx_callback, NULL);
}

static void stm32wb_usbd_cdc_stop(void *context)
{
    stm32wb_usbd_cdc_control.started = false;
    stm32wb_usbd_cdc_control.suspended = false;
    
    stm32wb_usbd_cdc_int_flush();
    stm32wb_usbd_cdc_tx_flush();
    
    stm32wb_usbd_cdc_control.serial_state &= (USB_CDC_SERIAL_STATE_DCD | USB_CDC_SERIAL_STATE_DSR);
    stm32wb_usbd_cdc_control.break_state = 0;
    stm32wb_usbd_cdc_control.line_state = 0;
    stm32wb_usbd_cdc_control.line_coding.dwDTERate = STM32WB_USBD_CDC_LINE_CODING_DTE_RATE;
    stm32wb_usbd_cdc_control.line_coding.bCharFormat = STM32WB_USBD_CDC_LINE_CODING_CHAR_FORMAT;
    stm32wb_usbd_cdc_control.line_coding.bParityType = STM32WB_USBD_CDC_LINE_CODING_PARITY_TYPE;
    stm32wb_usbd_cdc_control.line_coding.bDataBits = STM32WB_USBD_CDC_LINE_CODING_DATA_BITS;
    
    stm32wb_usbd_dcd_ep_disable(STM32WB_USBD_CDC_CONTROL_EP_ADDR);
    stm32wb_usbd_dcd_ep_disable(STM32WB_USBD_CDC_DATA_IN_EP_ADDR);
    stm32wb_usbd_dcd_ep_disable(STM32WB_USBD_CDC_DATA_OUT_EP_ADDR);
}

static int stm32wb_usbd_cdc_request(void *context, int state, const stm32wb_usbd_request_t *request, uint8_t *data, const uint8_t **p_data_return, uint16_t *p_length_return, stm32wb_usbd_status_routine_t *p_status_routine_return)
{
    uint16_t line_state;
    int status;

    status = STM32WB_USBD_REQUEST_STATUS_UNHANDLED;
    
    switch (request->bmRequestType & USB_REQ_RECIPIENT_MASK) {
    case USB_REQ_RECIPIENT_INTERFACE: {
	if (request->wIndex == stm32wb_usbd_cdc_control.interface)
	{
	    switch (request->bmRequestType & USB_REQ_TYPE_MASK) {
	    case USB_REQ_TYPE_CLASS: {
		switch (request->bRequest) {
		case USB_REQ_CDC_SET_LINE_CODING: {
		    stm32wb_usbd_cdc_control.line_coding.dwDTERate = (uint32_t)((data[0] << 0) | (data[1] << 8) | (data[2] << 16) | (data[3] << 24));
		    stm32wb_usbd_cdc_control.line_coding.bCharFormat = data[4];
		    stm32wb_usbd_cdc_control.line_coding.bParityType = data[5];
		    stm32wb_usbd_cdc_control.line_coding.bDataBits = data[6];

		    if (stm32wb_usbd_cdc_control.state >= STM32WB_USBD_CDC_STATE_READY)
		    {
			if (stm32wb_usbd_cdc_control.ev_callback)
			{
			    (*stm32wb_usbd_cdc_control.ev_callback)(stm32wb_usbd_cdc_control.ev_context, STM32WB_USBD_CDC_EVENT_LINE_CODING);
			}
		    }

                    status = STM32WB_USBD_REQUEST_STATUS_SUCCESS;
		    break;
		}
		    
		case USB_REQ_CDC_GET_LINE_CODING: {
		    *p_data_return = data;
		    *p_length_return = 7;

		    data[0] = (uint8_t)(stm32wb_usbd_cdc_control.line_coding.dwDTERate >> 0);
		    data[1] = (uint8_t)(stm32wb_usbd_cdc_control.line_coding.dwDTERate >> 8);
		    data[2] = (uint8_t)(stm32wb_usbd_cdc_control.line_coding.dwDTERate >> 16);
		    data[3] = (uint8_t)(stm32wb_usbd_cdc_control.line_coding.dwDTERate >> 24);
		    data[4] = stm32wb_usbd_cdc_control.line_coding.bCharFormat;
		    data[5] = stm32wb_usbd_cdc_control.line_coding.bParityType;
		    data[6] = stm32wb_usbd_cdc_control.line_coding.bDataBits;     

                    status = STM32WB_USBD_REQUEST_STATUS_SUCCESS;
		    break;
		}
		    
		case USB_REQ_CDC_SET_CONTROL_LINE_STATE: {
		    line_state = stm32wb_usbd_cdc_control.line_state;
        
		    stm32wb_usbd_cdc_control.line_state = request->wValue;

		    if (stm32wb_usbd_cdc_control.state >= STM32WB_USBD_CDC_STATE_READY)
		    {
			if ((line_state & USB_CDC_LINE_STATE_DTR) && !(stm32wb_usbd_cdc_control.line_state & USB_CDC_LINE_STATE_DTR))
			{
			    stm32wb_usbd_cdc_tx_flush();
			}
                        
			if (stm32wb_usbd_cdc_control.ev_callback)
			{
			    (*stm32wb_usbd_cdc_control.ev_callback)(stm32wb_usbd_cdc_control.ev_context, STM32WB_USBD_CDC_EVENT_LINE_STATE);
			}
		    }

                    status = STM32WB_USBD_REQUEST_STATUS_SUCCESS;
		    break;
		}

		case USB_REQ_CDC_SEND_BREAK: {
		    stm32wb_usbd_cdc_control.break_state = request->wValue;

		    if (stm32wb_usbd_cdc_control.state >= STM32WB_USBD_CDC_STATE_READY)
		    {
			if (stm32wb_usbd_cdc_control.ev_callback)
			{
			    (*stm32wb_usbd_cdc_control.ev_callback)(stm32wb_usbd_cdc_control.ev_context, STM32WB_USBD_CDC_EVENT_BREAK_STATE);
			}
		    }
		    
                    status = STM32WB_USBD_REQUEST_STATUS_SUCCESS;
		    break;
		}

		default:
		    break;
		}
		break;
	    }

	    default:
		break;
	    }
	}
	break;
    }
	
    default:
	break;
    }

    return status;
}

static void stm32wb_usbd_cdc_suspend(void *context)
{
    stm32wb_usbd_cdc_control.suspended = true;
}

static void stm32wb_usbd_cdc_resume(void *context)
{
    stm32wb_usbd_cdc_control.suspended = false;

#if 0    
    if (stm32wb_usbd_cdc_control.int_request)
    {
        stm32wb_usbd_cdc_int_request();
    }

    if (stm32wb_usbd_cdc_control.tx_data)
    {
        if (armv7m_atomic_casb(&stm32wb_usbd_cdc_control.tx_busy, STM32WB_USBD_CDC_TX_IDLE, STM32WB_USBD_CDC_TX_BUSY) == STM32WB_USBD_CDC_TX_IDLE)
        {
#if (STM32WB_USBD_DCD_LPM_SUPPORTED == 1)
            stm32wb_usbd_dcd_lpm_reference(STM32WB_USBD_DCD_EP_MASK(STM32WB_USBD_CDC_DATA_IN_EP_ADDR));
#endif /* STM32WB_USBD_DCD_LPM_SUPPORTED == 1 */

            stm32wb_usbd_cdc_control.tx_zlp = stm32wb_usbd_cdc_control.tx_count && !(stm32wb_usbd_cdc_control.tx_count & (STM32WB_USBD_CDC_DATA_MAX_PACKET_SIZE -1));
            
            stm32wb_usbd_dcd_ep_transmit(STM32WB_USBD_CDC_DATA_IN_EP_ADDR, (uint8_t*)stm32wb_usbd_cdc_control.tx_data, stm32wb_usbd_cdc_control.tx_count, stm32wb_usbd_cdc_tx_callback, NULL);
        }
    }
#endif    
}

const stm32wb_usbd_class_t stm32wb_usbd_cdc_class = {
    stm32wb_usbd_cdc_configure,
    stm32wb_usbd_cdc_start,
    stm32wb_usbd_cdc_stop,
    stm32wb_usbd_cdc_request,
    stm32wb_usbd_cdc_suspend,
    stm32wb_usbd_cdc_resume,
    NULL,
    STM32WB_USBD_CDC_INTERFACE_COUNT,
    (STM32WB_USBD_EP_MASK(STM32WB_USBD_CDC_CONTROL_EP_ADDR) | STM32WB_USBD_EP_MASK(STM32WB_USBD_CDC_DATA_IN_EP_ADDR) | STM32WB_USBD_EP_MASK(STM32WB_USBD_CDC_DATA_OUT_EP_ADDR)),
};

/****************************************************************************************************************/    

static bool __svc_stm32wb_usbd_cdc_enable(uint8_t *rx_data, uint32_t rx_size, stm32wb_usbd_cdc_event_callback_t callback, void *context)
{
    if (stm32wb_usbd_cdc_control.state != STM32WB_USBD_CDC_STATE_INIT)
    {
	return false;
    }

    stm32wb_usbd_cdc_control.state = STM32WB_USBD_CDC_STATE_NOT_READY;

    stm32wb_usbd_cdc_control.ev_callback = callback;
    stm32wb_usbd_cdc_control.ev_context = context;

    stm32wb_usbd_cdc_control.rx_data = rx_data;
    stm32wb_usbd_cdc_control.rx_size = rx_size;
    stm32wb_usbd_cdc_control.rx_read = 0;
    stm32wb_usbd_cdc_control.rx_write = 0;
    stm32wb_usbd_cdc_control.rx_count = 0;
    stm32wb_usbd_cdc_control.rx_event = false;
    
    stm32wb_usbd_cdc_control.state = STM32WB_USBD_CDC_STATE_READY;

