GrumpyOldPizza/ArduinoCore-stm32wb/system/STM32WBxx/Source/stm32wb_usbd_cdc.c
    armv7m_atomic_orh(&stm32wb_usbd_cdc_control.serial_state, (USB_CDC_SERIAL_STATE_DCD | USB_CDC_SERIAL_STATE_DSR));

    stm32wb_usbd_cdc_int_request();
    
    return true;
}

static bool __svc_stm32wb_usbd_cdc_disable(void)
{
    if (stm32wb_usbd_cdc_control.state < STM32WB_USBD_CDC_STATE_READY)
    {
	return false;
    }
    
    stm32wb_usbd_cdc_int_flush();
    stm32wb_usbd_cdc_tx_flush();

    stm32wb_usbd_cdc_control.state = STM32WB_USBD_CDC_STATE_INIT;

    armv7m_atomic_andh(&stm32wb_usbd_cdc_control.serial_state, ~(USB_CDC_SERIAL_STATE_DCD | USB_CDC_SERIAL_STATE_DSR));

    stm32wb_usbd_cdc_int_request();

    return true;
}

static bool __svc_stm32wb_usbd_cdc_serial_state(uint16_t serial_state)
{
    armv7m_atomic_orh(&stm32wb_usbd_cdc_control.serial_state, (serial_state & ~(USB_CDC_SERIAL_STATE_DCD | USB_CDC_SERIAL_STATE_DSR)));

    stm32wb_usbd_cdc_int_request();

    return true;
}

static bool __svc_stm32wb_usbd_cdc_transmit(const stm32wb_usbd_cdc_transmit_params_t *params)
{
    if (!stm32wb_usbd_cdc_control.started)
    {
        return false;
    }

    if (stm32wb_usbd_cdc_control.suspended)
    {
        if (!stm32wb_usbd_wakeup())
        {
            return false;
        }
    }

    if (!(stm32wb_usbd_cdc_control.line_state & USB_CDC_LINE_STATE_DTR))
    {
        return false;
    }
    
    if (armv7m_atomic_cas((volatile uint32_t*)&stm32wb_usbd_cdc_control.tx_data, (uint32_t)NULL, (uint32_t)params->tx_data) != (uint32_t)NULL)
    {
        return false;
    }

    stm32wb_usbd_cdc_control.tx_count = params->tx_count;
    stm32wb_usbd_cdc_control.tx_callback = params->callback;
    stm32wb_usbd_cdc_control.tx_context = params->context;

    if (stm32wb_usbd_cdc_control.state == STM32WB_USBD_CDC_STATE_CONNECTED)
    {
        if (armv7m_atomic_casb(&stm32wb_usbd_cdc_control.tx_busy, STM32WB_USBD_CDC_TX_IDLE, STM32WB_USBD_CDC_TX_BUSY) == STM32WB_USBD_CDC_TX_IDLE)
        {
#if (STM32WB_USBD_DCD_LPM_SUPPORTED == 1)
            stm32wb_usbd_dcd_lpm_reference(STM32WB_USBD_DCD_EP_MASK(STM32WB_USBD_CDC_DATA_IN_EP_ADDR));
#endif /* STM32WB_USBD_DCD_LPM_SUPPORTED == 1 */
            
            stm32wb_usbd_cdc_control.tx_zlp = stm32wb_usbd_cdc_control.tx_count && !(stm32wb_usbd_cdc_control.tx_count & (STM32WB_USBD_CDC_DATA_MAX_PACKET_SIZE -1));
            
            stm32wb_usbd_dcd_ep_transmit(STM32WB_USBD_CDC_DATA_IN_EP_ADDR, (uint8_t*)stm32wb_usbd_cdc_control.tx_data, stm32wb_usbd_cdc_control.tx_count, stm32wb_usbd_cdc_tx_callback, NULL);
        }
    }
    
    return true;
}

bool stm32wb_usbd_cdc_enable(uint8_t *rx_data, uint32_t rx_size, stm32wb_usbd_cdc_event_callback_t callback, void *context)
{
    if (armv7m_core_is_in_thread())
    {
	return armv7m_svcall_4((uint32_t)&__svc_stm32wb_usbd_cdc_enable, (uint32_t)rx_data, (uint32_t)rx_size, (uint32_t)callback, (uint32_t)context);
    }

    if (armv7m_core_is_in_svcall_or_pendsv())
    {
	return __svc_stm32wb_usbd_cdc_enable(rx_data, rx_size, callback, context);
    }
    
    return false;
}

bool stm32wb_usbd_cdc_disable(void)
{
    if (armv7m_core_is_in_thread())
    {
	return armv7m_svcall_0((uint32_t)&__svc_stm32wb_usbd_cdc_disable);
    }

    if (armv7m_core_is_in_svcall_or_pendsv())
    {
	return __svc_stm32wb_usbd_cdc_disable();
    }
    
    return false;
}

void stm32wb_usbd_cdc_line_coding(stm32wb_usbd_cdc_line_coding_t *p_line_coding)
{
    p_line_coding->dwDTERate = stm32wb_usbd_cdc_control.line_coding.dwDTERate;
    p_line_coding->bCharFormat = stm32wb_usbd_cdc_control.line_coding.bCharFormat;
    p_line_coding->bParityType = stm32wb_usbd_cdc_control.line_coding.bParityType;
    p_line_coding->bDataBits = stm32wb_usbd_cdc_control.line_coding.bDataBits;
}

uint16_t stm32wb_usbd_cdc_line_state(void)
{
    return stm32wb_usbd_cdc_control.line_state;
}

uint16_t stm32wb_usbd_cdc_break_state(void)
{
    return stm32wb_usbd_cdc_control.break_state;
}

bool stm32wb_usbd_cdc_serial_state(uint16_t serial_state)
{
    if (stm32wb_usbd_cdc_control.state < STM32WB_USBD_CDC_STATE_READY)
    {
        return false;
    }

    if (armv7m_core_is_in_thread())
    {
	return armv7m_svcall_1((uint32_t)&__svc_stm32wb_usbd_cdc_serial_state, (uint32_t)serial_state);
    }
    else
    {
	return __svc_stm32wb_usbd_cdc_serial_state(serial_state);
    }
}

uint32_t stm32wb_usbd_cdc_count(void)
{
    if (stm32wb_usbd_cdc_control.state < STM32WB_USBD_CDC_STATE_READY)
    {
        return 0;
    }

    return stm32wb_usbd_cdc_control.rx_count;
}


int32_t stm32wb_usbd_cdc_peek(void)
{
    if (stm32wb_usbd_cdc_control.state < STM32WB_USBD_CDC_STATE_READY)
    {
        return -1;
    }

    if (stm32wb_usbd_cdc_control.rx_count == 0)
    {
        return -1;
    }

    return stm32wb_usbd_cdc_control.rx_data[stm32wb_usbd_cdc_control.rx_read];
}

uint32_t stm32wb_usbd_cdc_read(uint8_t *rx_data, uint32_t rx_size)
{
    uint32_t rx_total, rx_count, rx_read, rx_read_next;
    
    if (stm32wb_usbd_cdc_control.state < STM32WB_USBD_CDC_STATE_READY)
    {
        return 0;
    }

    if (stm32wb_usbd_cdc_control.rx_count == 0)
    {
        return 0;
    }

    rx_total = 0;

    while (rx_total < rx_size)
    {
	do
	{
	    rx_count = stm32wb_usbd_cdc_control.rx_count;
	    rx_read  = stm32wb_usbd_cdc_control.rx_read;
	    
	    if (rx_count > (stm32wb_usbd_cdc_control.rx_size - rx_read))
	    {
		rx_count = stm32wb_usbd_cdc_control.rx_size - rx_read;
	    }
	    
	    if (rx_count > (rx_size - rx_total))
	    {
		rx_count = rx_size - rx_total;
	    }

	    rx_read_next = rx_read + rx_count;

	    if (rx_read_next == stm32wb_usbd_cdc_control.rx_size)
	    {
		rx_read_next = 0;
	    }
        }
	while (armv7m_atomic_cash(&stm32wb_usbd_cdc_control.rx_read, rx_read, rx_read_next) != rx_read);

	if (!rx_count)
	{
	    break;
	}
	
	memcpy(&rx_data[rx_total], &stm32wb_usbd_cdc_control.rx_data[rx_read], rx_count);
	rx_total += rx_count;
	
	armv7m_atomic_subh(&stm32wb_usbd_cdc_control.rx_count, rx_count);
    }
    
    if (rx_total)
    {
	stm32wb_usbd_cdc_control.rx_event = true;
    }

    return rx_total;
}

bool stm32wb_usbd_cdc_transmit(const uint8_t *tx_data, uint32_t tx_count, stm32wb_usbd_cdc_done_callback_t callback, void *context)
{
    stm32wb_usbd_cdc_transmit_params_t params;

    if (stm32wb_usbd_cdc_control.state < STM32WB_USBD_CDC_STATE_READY)
    {
        return false;
    }
    
    params.tx_data = tx_data;
    params.tx_count = tx_count;
    params.callback = callback;
    params.context = context;

    if (armv7m_core_is_in_thread())
    {
	return armv7m_svcall_1((uint32_t)&__svc_stm32wb_usbd_cdc_transmit, (uint32_t)&params);
    }
    else
    {
	return __svc_stm32wb_usbd_cdc_transmit(&params);
    }
}

bool stm32wb_usbd_cdc_busy(void)
{
    return (stm32wb_usbd_cdc_control.tx_data != NULL);
}
